Project-RoR-Ver1-jmbariani-P50117-P47925/app/controllers/categories_controller.rb

INSERT INTO "categories" ("updated_at", "title", "created_at") VALUES('2009-09-15 06:51:05', 'Food', '2009-09-15 06:51:05')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save