Project-RoR-Ver1-jmbariani-P50117-P47925/app/controllers/exposures_controller.rb

  def index
    @exposures = Exposure.all
---
SELECT * FROM "exposures"

  def show
    @exposure = Exposure.find(params[:id])
---
SELECT * FROM "exposures" WHERE ("exposures"."id" = 1)

  def edit
    @exposure = Exposure.find(params[:id])
---
SELECT * FROM "exposures" WHERE ("exposures"."id" = 1)

  def create
    @exposure = Exposure.new(params[:exposure])

    respond_to do |format|
      if @exposure.save

        if !params[:file_data].nil? #start save image
        @image = Image.new
        @image.file_data = params[:file_data]
          if @image.save #if image save.. save the image id to exposure column.
          @exposure.image_id = @image.id
---
INSERT INTO "exposures" ("updated_at", "media_name", "content", "image_id", "created_at") VALUES('2009-09-17 00:34:11', 'Berita Harian', 'BERITA HARIAN Cita rasa Muar inspirasi tiga beradik
INSERT INTO "images" ("updated_at", "extension", "created_at") VALUES('2009-09-15 18:10:37', 'nasibarianiayamgoreng.jpg', '2009-09-15 18:10:37')

  def update
    @exposure = Exposure.find(params[:id])

    respond_to do |format|
      if @exposure.update_attributes(params[:exposure])
---
SELECT * FROM "exposures" WHERE ("exposures"."id" = 1)
UPDATE "exposures" SET "content" = 'STAR METRO Beriani with a wider appeal

  def destroy
    @exposure = Exposure.find(params[:id])
    @image = Image.find(:first, :conditions => ["id = ?",@exposure.image_id])
    @image.destroy unless @image.nil?
---
SELECT * FROM "exposures" WHERE ("exposures"."id" = 1)
SELECT * FROM "images" WHERE (id = 33) LIMIT 1
DELETE FROM "exposures" WHERE "id" = 1
DELETE FROM "images" WHERE "id" = 33