Project-RoR-Ver1-jmbariani-P50117-P47925/app/controllers/outlets_controller.rb

SELECT * FROM "outlets"
---
  def index
    @outlets = Outlet.all

SELECT * FROM "outlets" WHERE ("outlets"."id" = 1)
---
  def show
    @outlet = Outlet.find(params[:id])

SELECT * FROM "outlets" WHERE ("outlets"."id" = 1)
---
  def edit
    @outlet = Outlet.find(params[:id])

INSERT INTO "outlets" ("updated_at", "title", "main", "address", "image_id", "created_at") VALUES('2009-09-15 16:26:23', 'Subang Jaya', NULL, 'No.29, SS18/6, Subang Jaya, Selangor Darul Ehsan', NULL, '2009-09-15 16:26:23')
INSERT INTO "images" ("updated_at", "extension", "created_at") VALUES('2009-09-15 16:00:15', 'subang1.jpg', '2009-09-15 16:00:15')
---
  def create
    @outlet = Outlet.new(params[:outlet])

    respond_to do |format|
      if @outlet.save

          if !params[:file_data].nil? #start save image
          @image = Image.new
          @image.file_data = params[:file_data]
            if @image.save #if image save.. save the image id to menu column.
            @outlet.image_id = @image.id

SELECT * FROM "outlets" WHERE ("outlets"."id" = 5)
UPDATE "outlets" SET "main" = 1, "updated_at" = '2009-09-15 17:25:34' WHERE "id" = 5
---
  def update
    @outlet = Outlet.find(params[:id])

    respond_to do |format|
      if @outlet.update_attributes(params[:outlet])

SELECT * FROM "outlets" WHERE ("outlets"."id" = 1)
SELECT * FROM "images" WHERE (id = 32) LIMIT 1
DELETE FROM "images" WHERE "id" = 32
DELETE FROM "outlets" WHERE "id" = 1
---
  def destroy
    @outlet = Outlet.find(params[:id])
     @image = Image.find(:first, :conditions => ["id = ?",@outlet.image_id])
    @image.destroy unless @image.nil?