Project-RoR-Ver1-jmbariani-P50117-P47925/app/controllers/restaurants_controller.rb

SELECT * FROM "menus" WHERE (category_id = 1)
---
def menu
  @categories = Category.find(:all)
  @foods = Menu.find(:all, :conditions => ["category_id = 1"])

SELECT * FROM "menus" WHERE ("menus"."id" = 1)
---
def show_menu
  @menu = Menu.find(params[:id])

SELECT * FROM "outlets" WHERE (main = 1) LIMIT 1
---
def outlets
@outlets = Outlet.find(:all)

SELECT * FROM "outlets" WHERE ("outlets"."id" = 5)
---
def show_outlet
  @outlets = Outlet.find(:all)

SELECT * FROM "exposures" WHERE ("exposures"."id" = 1)
---
def show_exposure
  if params[:id].nil?
    @exposure = Exposure.find(:first)

SELECT * FROM "menus" WHERE (title like '%%')
SELECT * FROM "outlets" WHERE (title like '%a%')
---
def search
@menus = Menu.find(:all,:conditions => ["title like ?", "%#{params[:query]}%"])
@outlets = Outlet.find(:all,:conditions => ["title like ?", "%#{params[:query]}%"])