students/app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT * FROM "students"

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 2)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "matrix", "updated_at", "email", "created_at") VALUES('abdul hadi', 'P50057', '2009-07-19 17:21:30', 'hadi@ftsm.ukm.my', '2009-07-19 17:21:30')

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT * FROM "students" WHERE ("students"."id" = 2)
UPDATE "students" SET "email" = 'azurawn@yahoo.com', "updated_at" = '2009-07-28 05:39:54' WHERE "id" = 7

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT * FROM "students" WHERE ("students"."id" = 5)
DELETE FROM "students" WHERE "id" = 5

  def find
#  @student = Student.find(:all,
#      :conditions=>["name = ? OR matrix = ?", params[:search_string], params[:search_string]])
      puts params[:search_string]
     @student = Student.find_all_by_name(params[:search_string]) | Student.find_all_by_matrix(params[:search_string])
---
SELECT * FROM "students" WHERE (name = 'azura kamarudin' OR matrix = 'azura kamarudin')