tickets/app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT * FROM "tickets"

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 2)

  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("name", "updated_at", "price", "seat_id", "address", "email", "created_at") VALUES('Azura Kamarudin', '2009-07-19 18:05:56', 'RM10', '1A', '43000 Kajang', 'azura@ftsm.ukm.my', '2009-07-19 18:05:56')

  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])
---
SELECT * FROM "tickets" WHERE ("tickets"."id" = 2)
UPDATE "tickets" SET "email" = 'johndoe@gmail.com', "updated_at" = '2009-07-19 18:07:28' WHERE "id" = 2