coconut/app/controllers/seats_controller.rb

SELECT * FROM "seats"
---
  def index
    @seats = Seat.all

SELECT * FROM "seats" WHERE ("seats"."id" = 1)
---
  def show
    @seat = Seat.find(params[:id])

SELECT * FROM "seats" WHERE ("seats"."id" = 1)
---
  def edit
    @seat = Seat.find(params[:id])

SELECT * FROM "seats" WHERE ("seats"."id" = 14)
UPDATE "seats" SET "name" = 'Charlie Chaplin', "updated_at" = '2009-07-29 06:41:06' WHERE "id" = 14
---
  def update
    @seat = Seat.find(params[:id])

    respond_to do |format|
      if @seat.update_attributes(params[:seat])

INSERT INTO "seats" ("name", "updated_at", "flight_id", "baggage", "created_at") VALUES('Azura Wan Nor', '2009-07-29 02:29:49', 1, 25.0, '2009-07-29 02:29:49')
---
 def create
    @seat = Seat.new(params[:seat])
    render :update do |page|
    if @seat.save

SELECT * FROM "seats" WHERE ("seats"."id" = 7)
DELETE FROM "seats" WHERE "id" = 7
---
  def destroy
    @seat = Seat.find(params[:id])
    @seat.destroy

SELECT * FROM "flights" WHERE ("flights"."id" = 2)
---
  def flight_seats
  	@flight = Flight.find(params[:flight_id])